{
  "basics": {
    "name": "Li-Cheng Xu",
    "label": "AI4S Researcher",
    "image": "",
    "email": "lcxu1997@gmail.com",
    "url": "https://scholar.google.com/citations?user=xuFKps4AAAAJ",
    "summary": "A researcher working at the forefront of AI applications in chemistry, developing machine learning approaches to solve fundamental challenges in chemical synthesis, molecular modeling, and physical science",
    "location": {
      "address": "18 Longyao Rd",
      "postalCode": "200232",
      "city": "Shanghai",
      "countryCode": "CN",
      "region": "Shanghai"
    },
    "profiles": [
      {
        "network": "Google Scholar",
        "username": "Li-Cheng Xu",
        "url": "https://scholar.google.com/citations?user=xuFKps4AAAAJ"
      }
    ]
  },
  "work": [
    {
      "name": "Shanghai Academy of Artificial Intelligence for Science",
      "position": "Researcher of AI for physical science",
      "url": "https://scholar.google.com/citations?user=xuFKps4AAAAJ",
      "startDate": "2024-07-01",
      "endDate": "now",
      "summary": "Applying cutting-edge deep learning techniques to build structure-performance relationships for chemical reactions",
      "highlights": ["RXNGraphormer"]
    }
  ],
  "education": [
    {
      "institution": "Zhejiang University",
      "location": "Hangzhou, China",
      "url": "https://www.zju.edu.cn/",
      "area": "AI for chemistry algorithms development",
      "studyType": "PhD",
      "startDate": "2019-09-01",
      "endDate": "2024-07-01"
    }
  ],
  "publications": [
    {
      "name": "Enantioselectivity prediction of pallada-electrocatalysed C-H activation using transition state knowledge in machine learning",
      "publisher": "Nature Synthesis",
      "releaseDate": "2023-01-30",
      "url": "https://www.nature.com/articles/s44160-022-00233-y",
      "summary": "We developed a machine learning model that can predict the enantioselectivity of pallada-electrocatalysed C-H activation reactions based on transition state knowledge. (First author)"
    },
    {
      "name": "Towards Data-Driven Design of Asymmetric Hydrogenation of Olefins: Database and Hierarchical Learning",
      "publisher": "Angewandte Chemie International Edition",
      "releaseDate": "2021-08-09",
      "url": "https://onlinelibrary.wiley.com/doi/10.1002/anie.202106880",
      "summary": "We built a large database of asymmetric hydrogenation reactions and developed a hierarchical learning model to predict the enantioselectivity of these reactions. (First author)"
    },
    {
      "name": "A Molecular Stereostructure Descriptor Based On Spherical Projection",
      "publisher": "Synlett",
      "releaseDate": "2020-11-18",
      "url": "https://www.thieme-connect.de/products/ejournals/abstract/10.1055/s-0040-1705977",
      "summary": "We designed a molecular descriptor based on spherical projection which could capture subtle variation of molecular steric environment. (First author)"
    },
    {
      "name": "Transfer Learning-Enabled Ligand Prediction for Ni-Catalyzed Atroposelective Suzuki-Miyaura Cross-Coupling Based on Mechanistic Similarity: Leveraging Pd Knowledge for Ni Discovery",
      "publisher": "Journal of the American Chemical Society",
      "releaseDate": "2025-03-28",
      "url": "https://pubs.acs.org/doi/10.1021/jacs.5c00838",
      "summary": "We developed a transfer learning model that can predict the ligand for Ni-catalyzed atroposelective Suzuki-Miyaura cross-coupling reactions based on the mechanism similarity of Pd-catalyzed reactions. (Co-first author, third position)"
    },
    {
      "name": "Electrocatalyzed direct arene alkenylations without directing groups for selective late-stage drug diversification",
      "publisher": "Nature Communications",
      "releaseDate": "2023-07-15",
      "url": "https://www.nature.com/articles/s41467-023-39747-0",
      "summary": "We developed a electrocatalytic method for direct arene alkenylations without directing groups for selective late-stage drug diversification. (Co-author)"
    },
    {
      "name": "Reaction performance prediction with an extrapolative and interpretable graph model based on chemical knowledge",
      "publisher": "Nature Communications",
      "releaseDate": "2023-06-15",
      "url": "https://www.nature.com/articles/s41467-023-39283-x",
      "summary": "We developed a graph neural network based on chemical knowledge to predict the reaction reactivity and selectivity of chemical reactions. (Co-author)"
    },
    {
      "name": "Data-driven design of new chiral carboxylic acid for construction of indoles with C-central and C-N axial chirality via cobalt catalysis",
      "publisher": "Nature Communications",
      "releaseDate": "2023-05-31",
      "url": "https://www.nature.com/articles/s41467-023-38872-0",
      "summary": "We developed a machine learning method to guide the design of new chiral carboxylic acids for the construction of indoles with C-central and C-N axial chirality via cobalt catalysis. (Co-author)"
    },
    {
      "name": "Exploring Spectrum-based Molecular Descriptors for Reaction Performance Prediction",
      "publisher": "Chemistry - An Asian Journal",
      "releaseDate": "2023-02-10",
      "url": "https://aces.onlinelibrary.wiley.com/doi/10.1002/asia.202300011",
      "summary": "We proposed a novel spectrum-based molecular descriptor for reaction performance prediction. (Co-author)"
    },
    {
      "name": "Bridging Chemical Knowledge and Machine Learning for Performance Prediction of Organic Synthesis",
      "publisher": "Chemistry - A European Journal",
      "releaseDate": "2022-10-07",
      "url": "https://doi.org/10.1002/chem.202202834",
      "summary": "A review discussing the integration of chemical knowledge and machine learning for performance prediction of organic synthesis. (Co-author)"
    },
    {
      "name": "When machine learning meets molecular synthesis",
      "publisher": "Trends in Chemistry",
      "releaseDate": "2022-08-31",
      "url": "https://doi.org/10.1016/j.trechm.2022.07.005",
      "summary": "A review discussing the integration of machine learning and molecular synthesis. (Co-author)"
    },
    {
      "name": "Predicting Regioselectivity in Radical C-H Functionalization of Heterocycles through Machine Learning",
      "publisher": "Angewandte Chemie International Edition",
      "releaseDate": "2020-05-02",
      "url": "https://onlinelibrary.wiley.com/doi/10.1002/anie.202000959",
      "summary": "We developed a machine learning model to predict the regioselectivity of radical C-H functionalization of heterocycles. (Co-author)"
    }
  ]
}
